[
    {
        "id": "f6650856-fe7b-43cb-af06-d7b511c2891c",
        "type": "Arrangement",
        // add names into context 
        // context -> At the annual citywide basketball tournament, there are four players. Aaron, Charlie, David, Benjamin. These players have varying heights. These players are known for their unique skills on the court, and their heights play a significant role in their performance. Their heights are categorized from shortest (1) to tallest (4).
        "context": "At the annual citywide basketball tournament, four  from different teams have garnered attention due to their varying heights. These players are known for their unique skills on the court, and their heights play a significant role in their performance. Their heights are categorized from shortest (1) to tallest (4).",
        "nl_premises": "Player Aaron is shorter than Player Charlie, indicating Aaron's potential advantage in speed and agility. Player David is taller than Player Benjamin, hinting at David's ability to perform better in rebounds and blocks. Player Charlie, while taller than Aaron, is shorter than David, suggesting a balanced skill set. Player Benjamin is taller than Aaron, indicating his advantage in reach. However, Player Benjamin and Player Charlie do not share the same height, showing a variety in the physical makeup of the players. Lastly, Player David is not the second shortest, further emphasizing his height advantage on the court. These height differences add an extra layer of complexity to the competition, with each player leveraging their stature to outperform the others.",
        // edit this to be Aaron < Charlie...
        "sym_premises": [
            "position(1) < position(3) ",
            "position(4) > position(2) ",
            "position(3) < position(4) ",
            "position(2) > position(1) ",
            "position(2) != position(3) ",
            "position(4) != 2"
            "Peter != 2"
        ],
        "nl_query": "Player David is the tallest among the four players.",
        "sym_query": "position(4) == 4",
        "label": true,
        "z3_program": "from z3 import *\nfrom itertools import combinations\n\nposition = Function(\"pos\", IntSort(), IntSort())\nclauses = []\n\nfor i in range(1, 5):\n\tclauses.append(Or(position(i)==1, position(i)==2, position(i)==3, position(i)==4))\n\nfor comb in combinations(range(1, 5), 2):\n\tclauses.append(position(comb[0])!= position(comb[1]))\n\nclauses.append(position(1) < position(3))\nclauses.append(position(4) > position(2))\nclauses.append(position(3) < position(4))\nclauses.append(position(2) > position(1))\nclauses.append(position(2) != position(3))\nclauses.append(position(4) != 2)\n\nconclusion = Not(position(4) == 4)\n\n"
    }
]